; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v9)
             (pred_3 ?v6 ?v11)
             (pred_9 ?v5 ?v11)
             (pred_11 ?v12 ?v5 )
	     (pred_7 ?v5)
             (pred_5 ?v1)
             (pred_1 ?v6)
             (pred_8 ?v11)
             (pred_2 ?v5)
             (pred_4 ?v6)
             (pred_12 ?v5)
             (pred_10 ))



(:action op_4
:parameters (?v8 ?v3 ?v2 ?v7)
:precondition (and (pred_5 ?v8) (pred_5 ?v3) (pred_1 ?v2) (pred_8 ?v7)
          (pred_6 ?v8 ?v3) (pred_3 ?v2 ?v7)
                   (pred_9 ?v3 ?v7) (pred_7 ?v8) 
                   (pred_2 ?v3) (pred_4 ?v2))
:effect (and  (pred_12 ?v3) (not (pred_2 ?v3))))


(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_5 ?v8) (pred_5 ?v10)
               (pred_7 ?v8) (pred_6 ?v8 ?v10) (pred_12 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v8))))

(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_5 ?v8) (pred_1 ?v2) 
                  (pred_7 ?v8) (pred_11 ?v2 ?v8) (pred_10 ))
:effect (and (pred_4 ?v2)
   (not (pred_11 ?v2 ?v8)) (not (pred_10 ))))


(:action op_3
:parameters (?v8 ?v13 ?v4)
:precondition (and (pred_5 ?v8) (pred_1 ?v13) (pred_1 ?v4)
                  (pred_7 ?v8) (pred_4 ?v4) (pred_11 ?v13 ?v8))
:effect (and (pred_4 ?v13) (pred_11 ?v4 ?v8)
        (not (pred_4 ?v4)) (not (pred_11 ?v13 ?v8))))

(:action op_2
:parameters (?v8 ?v2)
:precondition (and (pred_5 ?v8) (pred_1 ?v2) 
                  (pred_7 ?v8) (pred_4 ?v2))
:effect (and (pred_10 ) (pred_11 ?v2 ?v8) (not (pred_4 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_21 obj_07 obj_04 obj_23 obj_03 obj_20 obj_24 obj_28 obj_10 obj_26 obj_22 obj_01 obj_15 obj_18 obj_30 obj_12 obj_27 obj_14 obj_17 obj_13 obj_19 obj_08 obj_29 obj_11
    obj_16 obj_02
    obj_09 obj_25 obj_06
    )

    (:init
       (pred_10)

       (pred_5 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_04)
       (pred_5 obj_23)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_24)
       (pred_5 obj_28)
       (pred_5 obj_10)
       (pred_5 obj_26)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_18)
       (pred_5 obj_30)
       (pred_5 obj_12)
       (pred_5 obj_27)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_29)
       (pred_5 obj_11)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_1 obj_09)
       (pred_1 obj_25)
       (pred_1 obj_06)

       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_04 obj_28)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_23 obj_10)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_03 obj_26)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_20 obj_24)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_24 obj_20)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_28 obj_04)
       (pred_6 obj_28 obj_24)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_23)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_26 obj_03)
       (pred_6 obj_22 obj_12)
       (pred_6 obj_22 obj_01)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_01 obj_22)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_30 obj_13)
       (pred_6 obj_30 obj_12)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_27)
       (pred_6 obj_12 obj_22)
       (pred_6 obj_12 obj_30)
       (pred_6 obj_27 obj_08)
       (pred_6 obj_27 obj_14)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_27 obj_12)
       (pred_6 obj_14 obj_29)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_27)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_13 obj_30)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_08 obj_29)
       (pred_6 obj_08 obj_27)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_29 obj_11)
       (pred_6 obj_29 obj_14)
       (pred_6 obj_29 obj_08)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_11 obj_29)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_14)
       (pred_9  obj_20 obj_16)
       (pred_9  obj_21 obj_02)
       (pred_9  obj_14 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_04)
       (pred_12 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_28)
       (pred_12 obj_10)
       (pred_12 obj_26)
       (pred_12 obj_22)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_18)
       (pred_12 obj_30)
       (pred_12 obj_12)
       (pred_12 obj_27)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_11)

       (pred_3  obj_09 obj_16)
       (pred_3  obj_25 obj_02)
       (pred_3  obj_06 obj_16)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_25 obj_18)
       (pred_11 obj_06 obj_21)
       (pred_7 obj_30)
    )

    (:goal (and
       (pred_11 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_15)))
)
)

; plan
1. (op_5 obj_30 obj_26)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_26)
   goals met: 0 of 1
2. (op_5 obj_26 obj_03)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_05)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_09)
   deleted: (pred_11 obj_09 obj_05) (pred_10)
   added: (pred_4 obj_09)
   goals met: 0 of 1
5. (op_5 obj_05 obj_03)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_26)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_26)
   goals met: 0 of 1
7. (op_5 obj_26 obj_22)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_22)
   goals met: 0 of 1
8. (op_5 obj_22 obj_01)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_01)
   goals met: 0 of 1
9. (op_5 obj_01 obj_27)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_27)
   goals met: 0 of 1
10. (op_5 obj_27 obj_08)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_08)
   goals met: 0 of 1
11. (op_5 obj_08 obj_29)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_29)
   goals met: 0 of 1
12. (op_5 obj_29 obj_11)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_11)
   goals met: 0 of 1
13. (op_2 obj_11 obj_09)
   deleted: (pred_4 obj_09)
   added: (pred_10) (pred_11 obj_09 obj_11)
   goals met: 1 of 1
